# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80  # number of classes
scales: # model compound scaling constants, i.e. 'model=snn_yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]  # YOLOv8n summary: 225 layers,  3157200 parameters,  3157184 gradients,   8.9 GFLOPs
  s: [1, 1, 1024]  # YOLOv8s summary: 225 layers, 11166560 parameters, 11166544 gradients,  28.8 GFLOPs
  m: [0.67, 0.75, 768]   # YOLOv8m summary: 295 layers, 25902640 parameters, 25902624 gradients,  79.3 GFLOPs
  l: [1.00, 1.00, 512]   # YOLOv8l summary: 365 layers, 43691520 parameters, 43691504 gradients, 165.7 GFLOPs
  x: [1.00, 1.25, 512]   # YOLOv8x summary: 365 layers, 68229648 parameters, 68229632 gradients, 258.5 GFLOPs




# coco 新，改动为6,12,24行
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv_1, [64, 7, 2]],  # 0
   [-1, 1, BasicBlock_2, [64, 3, 2]], #1
   [-1, 2, BasicBlock_2, [64, 3, 1]],
   [-1, 1, Concat_res2, [128, 3, 2]], #3
   [-1, 3, BasicBlock_2, [128, 3, 1]],
   [-1, 1, Concat_res2, [256, 3, 2]],
   [-1, 5, BasicBlock_2, [256, 3, 1]],
   [-1, 1, Concat_res2, [512, 3, 2]], #7
   [-1, 2, BasicBlock_2, [512, 3, 1]],

  ]

# YOLOv3-tiny head
head:
  [[-1, 1, BasicBlock_1, [256, 1]], #9
   [-1, 1, BasicBlock_2, [512, 3, 1]],  # 10 (P5/32-large)

   [-2, 1, BasicBlock_2, [128, 1, 1]],
   [-1, 1, Sample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [2]],  # cat backbone P4
   [-1, 1, BasicBlock_2, [256, 3, 1]],  # 14 (P4/16-medium)

#    [ -1,1,BasicBlock_2,[ 64,1,1 ] ], #medium2
#    [ -1, 1, Sample, [ None, 2, 'nearest' ] ],
#    [ [ -1, 4 ], 1, Concat, [ 2 ] ],  # cat backbone P4
#    [ -1, 1, BasicBlock_2, [ 256, 3, 1 ] ],  # 14 (P4/16-medium)

   [[14, 10], 1, SpikeDetect, [nc]],  # Detect(P4, P5)
  ]

